### Import Numpy and Pandas Libraries

In [1]:
import numpy as np
import pandas as pd

In [2]:
print('Numpy version',np.__version__)
print('Pandas version',pd.__version__)

Numpy version 1.23.5
Pandas version 1.5.3

1. Read the '.csv' file into a data frame and display the first 5 rows.

In [3]:
df=pd.read_csv("Forbes_Billionaire.csv")
df.head()

,Rank,Name,Age,Net Worth,Country,Source,Industries
0,1,JEFF BEZOS,56.0,113.0,United States,Amazon,Technology
1,2,BILL GATES,64.0,98.0,United States,Microsoft,Technology
2,3,BERNARD ARNAULT & FAMILY,71.0,76.0,France,LVMH,Fashion & Retail
3,4,WARREN BUFFETT,89.0,67.5,United States,Berkshire Hathaway,Finance & Investments
4,5,LARRY ELLISON,75.0,59.0,United States,software,Technology

2. Naming the top 8 industries with maximum count of billionaires

In [9]:
pd.DataFrame(df.groupby('Industries')['Name'].nunique()).sort_values(by='Name',ascending=False).head(8)

                       Name
Industries
Finance & Investments   298
Technology              241
Fashion & Retail        209
Manufacturing           198
Real Estate             196
Diversified             169
Food & Beverage         168
Healthcare              149

In [11]:
df_top8=pd.DataFrame(df.groupby('Industries')['Name'].nunique()).reset_index().sort_values(by='Name',ascending=False).head(8)
df_top8

               Industries  Name
5   Finance & Investments   298
16             Technology   241
4        Fashion & Retail   209
10          Manufacturing   198
13            Real Estate   196
2             Diversified   169
6         Food & Beverage   168
8              Healthcare   149

In [12]:
df_top8.iloc[0:8,0:1]

               Industries
5   Finance & Investments
16             Technology
4        Fashion & Retail
10          Manufacturing
13            Real Estate
2             Diversified
6         Food & Beverage
8              Healthcare

3. Stating the headcount of billionaires from these top 8 industries

In [13]:
df_top8

               Industries  Name
5   Finance & Investments   298
16             Technology   241
4        Fashion & Retail   209
10          Manufacturing   198
13            Real Estate   196
2             Diversified   169
6         Food & Beverage   168
8              Healthcare   149

4. Comparing the mean of net worth of billionaires from these top 8 industries.

In [14]:
## Creating a new data frame for storing the values of only the top 8 industries with the maximum billionaires

new_df_top8= pd.DataFrame(columns=df.columns)
new_df_top8

Empty DataFrame
Columns: [Rank, Name, Age, Net Worth, Country, Source, Industries]
Index: []

In [15]:
## Running a loop to get 8 industries with the most number of billionaries

for i in df_top8['Industries']: 
    a=df[df['Industries']==i] #subsetting the original data frame with these industries
    new_df_top8 = new_df_top8.append(a)# appending the subset into the new data frame created in the last steo

C:\Users\shiva\AppData\Local\Temp\ipykernel_18776\1469756958.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  new_df_top8 = new_df_top8.append(a) # appending the subset into the new data frame created in the last steo
C:\Users\shiva\AppData\Local\Temp\ipykernel_18776\1469756958.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  new_df_top8 = new_df_top8.append(a) # appending the subset into the new data frame created in the last steo
C:\Users\shiva\AppData\Local\Temp\ipykernel_18776\1469756958.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  new_df_top8 = new_df_top8.append(a) # appending the subset into the new data frame created in the last steo
C:\Users\shiva\AppData\Local\Temp\ipykernel_18776\1469756958.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  new_df_top8 = new_df_top8.append(a) # appending the subset into the new data frame created in the last steo
C:\Users\shiva\AppData\Local\Temp\ipykernel_18776\1469756958.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  new_df_top8 = new_df_top8.append(a) # appending the subset into the new data frame created in the last steo
C:\Users\shiva\AppData\Local\Temp\ipykernel_18776\1469756958.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  new_df_top8 = new_df_top8.append(a) # appending the subset into the new data frame created in the last steo
C:\Users\shiva\AppData\Local\Temp\ipykernel_18776\1469756958.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  new_df_top8 = new_df_top8.append(a) # appending the subset into the new data frame created in the last steo
C:\Users\shiva\AppData\Local\Temp\ipykernel_18776\1469756958.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  new_df_top8 = new_df_top8.append(a) # appending the subset into the new data frame created in the last steo

In [16]:
new_df_top8

,Rank,Name,Age,Net Worth,Country,Source,Industries
3,4,WARREN BUFFETT,89.0,67.5,United States,Berkshire Hathaway,Finance & Investments
36,36,JIM SIMONS,81.0,21.6,United States,hedge funds,Finance & Investments
38,39,JOSEPH SAFRA,81.0,19.9,Brazil,banking,Finance & Investments
45,46,RAY DALIO,70.0,18.0,United States,hedge funds,Finance & Investments
63,64,STEPHEN SCHWARZMAN,73.0,15.4,United States,investments,Finance & Investments
...,...,...,...,...,...,...,...
2016,1990,HENRI BEAUFOUR,54.0,1.0,France,pharmaceuticals,Healthcare
2020,1990,ANNE BEAUFOUR,56.0,1.0,France,pharmaceuticals,Healthcare
2025,1990,VADIM YAKUNIN,57.0,1.0,Russia,pharmacy,Healthcare
2067,1990,FAN MINHUA,58.0,1.0,China,pharmaceuticals,Healthcare
2086,1990,LI XIANYU & FAMILY,66.0,1.0,China,pharmaceuticals,Healthcare

In [17]:
new_df_top8['Industries'].unique()

array(['Finance & Investments', 'Technology', 'Fashion & Retail',
       'Manufacturing', 'Real Estate', 'Diversified', 'Food & Beverage',
       'Healthcare'], dtype=object)

In [18]:
for i in new_df_top8['Industries'].unique():
    print('The average net worth of the billionaires of the industry',i,'is',new_df_top8[new_df_top8['Industries']==i]['Net Worth'].mean(),'billions.')

The average net worth of the billionaires of the industry Finance & Investments is 3.4302013422818796 billions.
The average net worth of the billionaires of the industry Technology is 5.634439834024897 billions.
The average net worth of the billionaires of the industry Fashion & Retail is 5.372727272727273 billions.
The average net worth of the billionaires of the industry Manufacturing is 2.7303030303030305 billions.
The average net worth of the billionaires of the industry Real Estate is 3.277551020408164 billions.
The average net worth of the billionaires of the industry Diversified is 3.2934911242603553 billions.
The average net worth of the billionaires of the industry Food & Beverage is 3.7083333333333335 billions.
The average net worth of the billionaires of the industry Healthcare is 2.857046979865771 billions.

In [26]:
print('The mean net worth of the billionaires from these industries is:',round(new_df_top8['Net Worth'].mean(),3),'billions.')

The mean net worth of the billionaires from these industries is: 3.864 billions.

5. Comparing the mean age of billionaires from these top 8 industries.

In [29]:
for i in new_df_top8['Industries'].unique():
    print('the average age of the billioners in the indistry',i,'is',new_df_top8[new_df_top8['Industries']==i]['Age'].mean(),'years')

the average age of the billioners in the indistry Finance & Investments is 65.8108108108108 years
the average age of the billioners in the indistry Technology is 55.37552742616034 years
the average age of the billioners in the indistry Fashion & Retail is 66.89320388349515 years
the average age of the billioners in the indistry Manufacturing is 64.139896373057 years
the average age of the billioners in the indistry Real Estate is 65.89528795811518 years
the average age of the billioners in the indistry Diversified is 66.88957055214723 years
the average age of the billioners in the indistry Food & Beverage is 64.8625 years
the average age of the billioners in the indistry Healthcare is 63.08843537414966 years

In [30]:
print('the mean age of the billionares from these industries is:',round(new_df_top8['Age'].mean(),2),'years')

the mean age of the billionares from these industries is: 63.97 years

6. The Richest billionaire in the Automotive sector

In [27]:
df['Industries'].unique()

array(['Technology', 'Fashion & Retail', 'Finance & Investments',
       'Telecom', 'Media & Entertainment', 'Diversified', 'Energy',
       'Real Estate', 'Gambling & Casinos', 'Food & Beverage',
       'Automotive', 'Manufacturing', 'Metals & Mining', 'Service',
       'Healthcare', 'Logistics', 'Construction & Engineering', 'Sports'],
      dtype=object)

In [ ]:
df[df['Industries']=='Automotive'].sort_values(by='Net Worth',ascending=False).head(1)

In [25]:
print('The richest billionaires in the Automotive sector is',df[df['Industries']=='Automotive'].sort_values(by='Net Worth',ascending=False).head(1).values[0][1],'with the net worth of',df[df['Industries']=='Automotive'].sort_values(by='Net Worth',ascending=False).head(1).values[0][3],'Billions')

The richest billionaires in the Automotive sector is ELON MUSK with the net worth of 24.6 Billions

7. top 5 countries with maximum number of billionaires.

In [38]:
df_top5=pd.DataFrame(df.groupby('Country')['Name'].nunique()).reset_index().sort_values(by='Name',ascending = False).head(5)
df_top5

          Country  Name
68  United States   614
9           China   387
19        Germany   107
25          India   102
52         Russia    99

In [39]:
df_top5.iloc[0:5,0:1]

          Country
68  United States
9           China
19        Germany
25          India
52         Russia

8. The lowest mean age of billionaires these top 5 countries?

In [41]:
mean_age_df = pd.DataFrame(columns= ['Country','Mean'])
mean_age_df

Empty DataFrame
Columns: [Country, Mean]
Index: []

In [43]:
for i in df_top5['Country']:
    mean = df[df['Country'] ==i]['Age'].mean()
    print('The mean age of',i,'is',mean,'years.')
    mean_age_df = mean_age_df.append({'Country':i,'Mean Age':mean},ignore_index=True)

The mean age of United States is 66.91162029459902 years.
The mean age of China is 56.79002624671916 years.
The mean age of Germany is 64.14736842105263 years.
The mean age of India is 66.20618556701031 years.
The mean age of Russia is 56.84848484848485 years.

C:\Users\shiva\AppData\Local\Temp\ipykernel_18776\1499183464.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mean_age_df = mean_age_df.append({'Country':i,'Mean Age':mean},ignore_index=True)
C:\Users\shiva\AppData\Local\Temp\ipykernel_18776\1499183464.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mean_age_df = mean_age_df.append({'Country':i,'Mean Age':mean},ignore_index=True)
C:\Users\shiva\AppData\Local\Temp\ipykernel_18776\1499183464.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mean_age_df = mean_age_df.append({'Country':i,'Mean Age':mean},ignore_index=True)
C:\Users\shiva\AppData\Local\Temp\ipykernel_18776\1499183464.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mean_age_df = mean_age_df.append({'Country':i,'Mean Age':mean},ignore_index=True)
C:\Users\shiva\AppData\Local\Temp\ipykernel_18776\1499183464.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mean_age_df = mean_age_df.append({'Country':i,'Mean Age':mean},ignore_index=True)

In [44]:
mean_age_df.sort_values(by='Mean Age',ascending=True).head(1)

  Country Mean   Mean Age
1   China  NaN  56.790026

In [45]:
print('The country which has the lowest mean age amongst the top 5 countries with the maximum number of billionaires is',mean_age_df.sort_values(by='Mean Age',ascending=True).head(1).values[0][0],'with an average age of',round(mean_age_df.sort_values(by='Mean Age',ascending=True).head(1).values[0][1],2),'years.')

The country which has the lowest mean age amongst the top 5 countries with the maximum number of billionaires is China with an average age of nan years.

9. The richest Chinese billionaire and his net worth

In [46]:
print('The richest Chinese billionaire is',df[df['Country']=='China'].sort_values(by='Net Worth',ascending=False).head(1).values[0][1],'with a Net Worth of',df[df['Country']=='China'].sort_values(by='Net Worth',ascending=False).head(1).values[0][2],'billions.')

The richest Chinese billionaire is JACK MA with a Net Worth of 55.0 billions.

10. Top 5 Industries with maximum number of Indian billionaires.

In [47]:
pd.DataFrame(df[df['Country']=='India'].groupby('Industries')['Name'].nunique()).reset_index().sort_values(by='Name',ascending=False).head(5)

         Industries  Name
7        Healthcare    17
8     Manufacturing    14
2       Diversified    13
13       Technology    11
6   Food & Beverage     8

In [ ]:
print('The top 5 industries with maximum number of Indian billionaires are the following:')
pd.DataFrame(df[df['Country']=='India'].groupby('Industries')['Name'].nunique()).reset_index().sort_values(by='Name',ascending=False).head(5).iloc[0:5,0:1]

11. Names of all the Indian billionaires in global top 100 list.

In [48]:
top_100 = df.sort_values(by='Net Worth',ascending=False).head(100)
top_100

,Rank,Name,Age,Net Worth,Country,Source,Industries
0,1,JEFF BEZOS,56.0,113.0,United States,Amazon,Technology
1,2,BILL GATES,64.0,98.0,United States,Microsoft,Technology
2,3,BERNARD ARNAULT & FAMILY,71.0,76.0,France,LVMH,Fashion & Retail
3,4,WARREN BUFFETT,89.0,67.5,United States,Berkshire Hathaway,Finance & Investments
4,5,LARRY ELLISON,75.0,59.0,United States,software,Technology
...,...,...,...,...,...,...,...
95,96,LI SHUFU,56.0,12.4,China,automobiles,Automotive
96,96,HASSO PLATTNER & FAMILY,76.0,12.4,Germany,software,Technology
98,98,STEFAN QUANDT,53.0,12.3,Germany,BMW,Automotive
97,98,LIU YONGHAO & FAMILY,68.0,12.3,China,agribusiness,Service
99,100,KEN GRIFFIN,51.0,12.1,United States,hedge funds,Finance & Investments

In [49]:


top_100[top_100['Country']=='India']['Name'].values

array(['MUKESH AMBANI', 'RADHAKISHAN DAMANI & FAMILY'], dtype=object)

12. All the billionaires in India who are younger than 50 years. Also, their mean net worth

In [50]:


Indian_billionaires = df[df['Country']=='India']
Indian_billionaires

,Rank,Name,Age,Net Worth,Country,Source,Industries
20,21,MUKESH AMBANI,62.0,36.8,India,"petrochemicals, oil & gas",Energy
77,78,RADHAKISHAN DAMANI & FAMILY,65.0,13.8,India,"retail, investments",Fashion & Retail
102,103,SHIV NADAR,74.0,11.9,India,software services,Technology
128,129,UDAY KOTAK,61.0,10.4,India,banking,Finance & Investments
154,155,GAUTAM ADANI,57.0,8.9,India,"commodities, ports",Diversified
...,...,...,...,...,...,...,...
1888,1851,SANDEEP ENGINEER,58.0,1.1,India,plastic pipes,Manufacturing
1902,1851,S.D. SHIBULAL,65.0,1.1,India,software services,Technology
1970,1851,ARVIND PODDAR,62.0,1.1,India,tires,Automotive
1983,1851,MOFATRAJ MUNOT,75.0,1.1,India,real estate,Real Estate
2030,1990,ACHAL BAKERI,60.0,1.0,India,air coolers,Manufacturing

In [51]:
print('The names of the Indian Billionaires under the age of 50 are:')
Indian_billionaires[Indian_billionaires['Age']<50]['Name'].values

The names of the Indian Billionaires under the age of 50 are:

array(['VIJAY SHEKHAR SHARMA', 'BYJU RAVEENDRAN', 'VIKAS OBEROI',
       'RANJAN PAI', 'SHAMSHEER VAYALIL', 'SACHIN BANSAL', 'RADHA VEMBU',
       'BINNY BANSAL', 'ACHARYA BALKRISHNA'], dtype=object)

In [52]:
print('The average Net Worth of Indian Billionaires below the age of 50 is')
round(Indian_billionaires[Indian_billionaires['Age']<50]['Net Worth'].mean(),3)

The average Net Worth of Indian Billionaires below the age of 50 is

1.489

13. Indian billionaires from real estate sector who are richer than 'DONALD TRUMP'.

In [53]:
df[df['Name']=='DONALD TRUMP']

,Rank,Name,Age,Net Worth,Country,Source,Industries
1047,1001,DONALD TRUMP,73.0,2.1,United States,real estate,Real Estate

In [54]:
Indian_billionaires_realestate = Indian_billionaires[Indian_billionaires['Industries']=='Real Estate']
Indian_billionaires_realestate

,Rank,Name,Age,Net Worth,Country,Source,Industries
494,494,KUSHAL PAL SINGH,88.0,3.7,India,real estate,Real Estate
774,764,CHANDRU RAHEJA,79.0,2.7,India,real estate,Real Estate
1237,1196,VIKAS OBEROI,49.0,1.8,India,real estate,Real Estate
1253,1196,MANGAL PRABHAT LODHA,64.0,1.8,India,real estate,Real Estate
1395,1335,JITENDRA VIRWANI,54.0,1.6,India,real estate,Real Estate
1712,1613,NIRANJAN HIRANANDANI,70.0,1.3,India,real estate,Real Estate
1716,1613,SUBHASH RUNWAL,76.0,1.3,India,real estate,Real Estate
1983,1851,MOFATRAJ MUNOT,75.0,1.1,India,real estate,Real Estate

In [55]:
Indian_billionaires_realestate[Indian_billionaires_realestate['Net Worth']>df[df['Name']=='DONALD TRUMP'].values[0][3]]

     Rank              Name   Age  Net Worth Country       Source   Industries
494   494  KUSHAL PAL SINGH  88.0        3.7   India  real estate  Real Estate
774   764    CHANDRU RAHEJA  79.0        2.7   India  real estate  Real Estate

In [56]:
print('The Indian billionaires from the Real Estate Industry who are richer than Donald Trump are',Indian_billionaires_realestate[Indian_billionaires_realestate['Net Worth']>df[df['Name']=='DONALD TRUMP'].values[0][3]].iloc[0:2,1:2].values[0][0],'and',Indian_billionaires_realestate[Indian_billionaires_realestate['Net Worth']>df[df['Name']=='DONALD TRUMP'].values[0][3]].iloc[0:2,1:2].values[1][0])

The Indian billionaires from the Real Estate Industry who are richer than Donald Trump are KUSHAL PAL SINGH and CHANDRU RAHEJA

14. The total cumulative net worth of all the billionaires?

In [57]:
df['Net Worth'].sum()

8037.499999999999

# END